In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

# Object Creation
Creating a Series by passing a list of values, letting pandas create a default integer index

In [2]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0     1
1     3
2     5
3   NaN
4     6
5     8
dtype: float64

Creating a DataFrame by passing a numpy array, with a datetime index and labeled columns

In [3]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
df

                   A         B         C         D
2013-01-01  2.006219  0.979863 -0.065109  0.588451
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279
2013-01-04 -0.185134  0.589521 -0.725757 -0.868932
2013-01-05 -1.821512 -0.908784 -0.303391  0.236027
2013-01-06 -0.269234 -0.092784 -0.161369 -0.051555

Creating a DataFrame by passing a dict of objects that can be converted to series-like.

In [6]:
df2 = pd.DataFrame({ 
    'A' : 1.,
    'B' : pd.Timestamp('20130102'),
    'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
    'D' : np.array([3] * 4,dtype='int32'),
    'E' : pd.Categorical(["test","train","test","train"]),
    'F' : 'foo' })
df2

   A          B  C  D      E    F
0  1 2013-01-02  1  3   test  foo
1  1 2013-01-02  1  3  train  foo
2  1 2013-01-02  1  3   test  foo
3  1 2013-01-02  1  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

If you’re using IPython, tab completion for column names (as well as public attributes) is automatically enabled. Here’s a subset of the attributes that will be completed:
df2.<TAB>
df2.A                  df2.bool
df2.abs                df2.boxplot
df2.add                df2.C
df2.add_prefix         df2.clip
df2.add_suffix         df2.clip_lower
df2.align              df2.clip_upper
df2.all                df2.columns
df2.any                df2.combine
df2.append             df2.combine_first
df2.apply              df2.compound
df2.applymap           df2.consolidate
df2.as_blocks          df2.convert_objects
df2.asfreq             df2.copy
df2.as_matrix          df2.corr
df2.astype             df2.corrwith
df2.at                 df2.count
df2.at_time            df2.cov
df2.axes               df2.cummax
df2.B                  df2.cummin
df2.between_time       df2.cumprod
df2.bfill              df2.cumsum
df2.blocks             df2.D

# Viewing Data
See the top & bottom rows of the frame

In [8]:
df.head()

                   A         B         C         D
2013-01-01  2.006219  0.979863 -0.065109  0.588451
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279
2013-01-04 -0.185134  0.589521 -0.725757 -0.868932
2013-01-05 -1.821512 -0.908784 -0.303391  0.236027

In [9]:
df.tail()

                   A         B         C         D
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279
2013-01-04 -0.185134  0.589521 -0.725757 -0.868932
2013-01-05 -1.821512 -0.908784 -0.303391  0.236027
2013-01-06 -0.269234 -0.092784 -0.161369 -0.051555

Display the index, columns, and the underlying numpy data

In [10]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [11]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [12]:
df.values

array([[ 2.00621914,  0.97986347, -0.06510929,  0.58845062],
       [ 0.18695331, -0.2438938 , -0.43727855, -0.93431757],
       [-1.05803301, -0.76987021,  1.122813  , -1.00927877],
       [-0.18513405,  0.58952129, -0.72575694, -0.86893244],
       [-1.82151221, -0.90878351, -0.3033906 ,  0.23602739],
       [-0.26923431, -0.09278446, -0.16136887, -0.05155468]])

Describe shows a quick statistic summary of your data

In [14]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.190124 -0.074325 -0.095015 -0.339934
std    1.295152  0.743129  0.639813  0.686723
min   -1.821512 -0.908784 -0.725757 -1.009279
25%   -0.860833 -0.638376 -0.403807 -0.917971
50%   -0.227184 -0.168339 -0.232380 -0.460244
75%    0.093931  0.418945 -0.089174  0.164132
max    2.006219  0.979863  1.122813  0.588451

Transposing your data

In [15]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    2.006219    0.186953   -1.058033   -0.185134   -1.821512   -0.269234
B    0.979863   -0.243894   -0.769870    0.589521   -0.908784   -0.092784
C   -0.065109   -0.437279    1.122813   -0.725757   -0.303391   -0.161369
D    0.588451   -0.934318   -1.009279   -0.868932    0.236027   -0.051555

Sorting by an axis

In [16]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.588451 -0.065109  0.979863  2.006219
2013-01-02 -0.934318 -0.437279 -0.243894  0.186953
2013-01-03 -1.009279  1.122813 -0.769870 -1.058033
2013-01-04 -0.868932 -0.725757  0.589521 -0.185134
2013-01-05  0.236027 -0.303391 -0.908784 -1.821512
2013-01-06 -0.051555 -0.161369 -0.092784 -0.269234

Sorting by values

In [17]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-05 -1.821512 -0.908784 -0.303391  0.236027
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318
2013-01-06 -0.269234 -0.092784 -0.161369 -0.051555
2013-01-04 -0.185134  0.589521 -0.725757 -0.868932
2013-01-01  2.006219  0.979863 -0.065109  0.588451

# Selection
__Note__:
 While standard Python / Numpy expressions for selecting and setting are intuitive and come in handy for interactive work, for production code, we recommend the optimized pandas data access methods, .at, .iat, .loc, .iloc and .ix.

# Getting
Selecting a single column, which yields a Series, equivalent to df.A

In [18]:
df['A']

2013-01-01    2.006219
2013-01-02    0.186953
2013-01-03   -1.058033
2013-01-04   -0.185134
2013-01-05   -1.821512
2013-01-06   -0.269234
Freq: D, Name: A, dtype: float64

Selecting via [], which slices the rows.

In [19]:
df[0:3]

                   A         B         C         D
2013-01-01  2.006219  0.979863 -0.065109  0.588451
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279

In [20]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279
2013-01-04 -0.185134  0.589521 -0.725757 -0.868932

# Selection by Label
For getting a cross section using a label

In [21]:
df.loc[dates[0]]

A    2.006219
B    0.979863
C   -0.065109
D    0.588451
Name: 2013-01-01 00:00:00, dtype: float64

Selecting on a multi-axis by label

In [22]:
df.loc[:,['A','B']]

                   A         B
2013-01-01  2.006219  0.979863
2013-01-02  0.186953 -0.243894
2013-01-03 -1.058033 -0.769870
2013-01-04 -0.185134  0.589521
2013-01-05 -1.821512 -0.908784
2013-01-06 -0.269234 -0.092784

Showing label slicing, both endpoints are included

In [23]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  0.186953 -0.243894
2013-01-03 -1.058033 -0.769870
2013-01-04 -0.185134  0.589521

Reduction in the dimensions of the returned object

In [24]:
df.loc['20130102',['A','B']]

A    0.186953
B   -0.243894
Name: 2013-01-02 00:00:00, dtype: float64

For getting a scalar value

In [25]:
df.loc[dates[0],'A']

2.0062191441464594

For getting fast access to a scalar (equiv to the prior method)

In [26]:
df.at[dates[0],'A']

2.0062191441464594

# Selection by Position
Select via the position of the passed integers

In [27]:
df.iloc[3]

A   -0.185134
B    0.589521
C   -0.725757
D   -0.868932
Name: 2013-01-04 00:00:00, dtype: float64

By integer slices, acting similar to numpy/python

In [30]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -0.185134  0.589521
2013-01-05 -1.821512 -0.908784

By lists of integer position locations, similar to the numpy/python style

In [31]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  0.186953 -0.437279
2013-01-03 -1.058033  1.122813
2013-01-05 -1.821512 -0.303391

For slicing rows explicitly

In [32]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279

For slicing columns explicitly

In [33]:
df.iloc[:,1:3]

                   B         C
2013-01-01  0.979863 -0.065109
2013-01-02 -0.243894 -0.437279
2013-01-03 -0.769870  1.122813
2013-01-04  0.589521 -0.725757
2013-01-05 -0.908784 -0.303391
2013-01-06 -0.092784 -0.161369

For getting a value explicitly

In [34]:
df.iloc[1,1]

-0.24389379838519518

For getting fast access to a scalar (equiv to the prior method)

In [35]:
df.iat[1,1]

-0.24389379838519518

# Boolean Indexing
Using a single column’s values to select data.

In [36]:
df[df.A > 0]

                   A         B         C         D
2013-01-01  2.006219  0.979863 -0.065109  0.588451
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318

Selecting values from a DataFrame where a boolean condition is met.

In [37]:
df[df > 0]

                   A         B         C         D
2013-01-01  2.006219  0.979863       NaN  0.588451
2013-01-02  0.186953       NaN       NaN       NaN
2013-01-03       NaN       NaN  1.122813       NaN
2013-01-04       NaN  0.589521       NaN       NaN
2013-01-05       NaN       NaN       NaN  0.236027
2013-01-06       NaN       NaN       NaN       NaN

In [38]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01  2.006219  0.979863 -0.065109  0.588451    one
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318    one
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279    two
2013-01-04 -0.185134  0.589521 -0.725757 -0.868932  three
2013-01-05 -1.821512 -0.908784 -0.303391  0.236027   four
2013-01-06 -0.269234 -0.092784 -0.161369 -0.051555  three

In [39]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279   two
2013-01-05 -1.821512 -0.908784 -0.303391  0.236027  four

# Setting
Setting a new column automatically aligns the data by the indexes

In [42]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [43]:
df['F'] = s1

Setting values by label

In [44]:
df.at[dates[0],'A'] = 0

In [45]:
df

                   A         B         C         D   F
2013-01-01  0.000000  0.979863 -0.065109  0.588451 NaN
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318   1
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279   2
2013-01-04 -0.185134  0.589521 -0.725757 -0.868932   3
2013-01-05 -1.821512 -0.908784 -0.303391  0.236027   4
2013-01-06 -0.269234 -0.092784 -0.161369 -0.051555   5

Setting values by position

In [46]:
df.iat[0,1] = 0
df

                   A         B         C         D   F
2013-01-01  0.000000  0.000000 -0.065109  0.588451 NaN
2013-01-02  0.186953 -0.243894 -0.437279 -0.934318   1
2013-01-03 -1.058033 -0.769870  1.122813 -1.009279   2
2013-01-04 -0.185134  0.589521 -0.725757 -0.868932   3
2013-01-05 -1.821512 -0.908784 -0.303391  0.236027   4
2013-01-06 -0.269234 -0.092784 -0.161369 -0.051555   5

Setting by assigning with a numpy array

In [47]:
df.loc[:,'D'] = np.array([5] * len(df))
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.065109  5 NaN
2013-01-02  0.186953 -0.243894 -0.437279  5   1
2013-01-03 -1.058033 -0.769870  1.122813  5   2
2013-01-04 -0.185134  0.589521 -0.725757  5   3
2013-01-05 -1.821512 -0.908784 -0.303391  5   4
2013-01-06 -0.269234 -0.092784 -0.161369  5   5

A where operation with setting

In [48]:
df2 = df.copy()
df2[df2 > 0] = -df2
df2

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.065109 -5 NaN
2013-01-02 -0.186953 -0.243894 -0.437279 -5  -1
2013-01-03 -1.058033 -0.769870 -1.122813 -5  -2
2013-01-04 -0.185134 -0.589521 -0.725757 -5  -3
2013-01-05 -1.821512 -0.908784 -0.303391 -5  -4
2013-01-06 -0.269234 -0.092784 -0.161369 -5  -5

# Missing Data
pandas primarily uses the value _np.nan_ to represent missing data. It is by default not included in computations. See the Missing Data section
Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [49]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ['E'])
df1.loc[dates[0]:dates[1],'E'] = 1
df1

                   A         B         C  D   F   E
2013-01-01  0.000000  0.000000 -0.065109  5 NaN   1
2013-01-02  0.186953 -0.243894 -0.437279  5   1   1
2013-01-03 -1.058033 -0.769870  1.122813  5   2 NaN
2013-01-04 -0.185134  0.589521 -0.725757  5   3 NaN

To drop any rows that have missing data

In [50]:
df1.dropna(how='any')

                   A         B         C  D  F  E
2013-01-02  0.186953 -0.243894 -0.437279  5  1  1

Filling missing data

In [51]:
df1.fillna(value=5)

                   A         B         C  D  F  E
2013-01-01  0.000000  0.000000 -0.065109  5  5  1
2013-01-02  0.186953 -0.243894 -0.437279  5  1  1
2013-01-03 -1.058033 -0.769870  1.122813  5  2  5
2013-01-04 -0.185134  0.589521 -0.725757  5  3  5

To get the boolean mask where values are _nan_

In [52]:
pd.isnull(df1)

                A      B      C      D      F      E
2013-01-01  False  False  False  False   True  False
2013-01-02  False  False  False  False  False  False
2013-01-03  False  False  False  False  False   True
2013-01-04  False  False  False  False  False   True

# Operations
See the Basic section on Binary Ops
# Stats
Operations in general exclude missing data.
Performing a descriptive statistic

In [53]:
df.mean()

A   -0.524493
B   -0.237635
C   -0.095015
D    5.000000
F    3.000000
dtype: float64

Same operation on the other axis

In [54]:
df.mean(1)

2013-01-01    1.233723
2013-01-02    1.101156
2013-01-03    1.258982
2013-01-04    1.535726
2013-01-05    1.193263
2013-01-06    1.895322
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specified dimension.

In [55]:
s = pd.Series([1,3,5,np.nan,6,8], index=dates).shift(2)
s

2013-01-01   NaN
2013-01-02   NaN
2013-01-03     1
2013-01-04     3
2013-01-05     5
2013-01-06   NaN
Freq: D, dtype: float64

In [56]:
df.sub(s, axis='index')

                   A         B         C   D   F
2013-01-01       NaN       NaN       NaN NaN NaN
2013-01-02       NaN       NaN       NaN NaN NaN
2013-01-03 -2.058033 -1.769870  0.122813   4   1
2013-01-04 -3.185134 -2.410479 -3.725757   2   0
2013-01-05 -6.821512 -5.908784 -5.303391   0  -1
2013-01-06       NaN       NaN       NaN NaN NaN

# Apply
Applying functions to the data

In [58]:
df

                   A         B         C  D   F
2013-01-01  0.000000  0.000000 -0.065109  5 NaN
2013-01-02  0.186953 -0.243894 -0.437279  5   1
2013-01-03 -1.058033 -0.769870  1.122813  5   2
2013-01-04 -0.185134  0.589521 -0.725757  5   3
2013-01-05 -1.821512 -0.908784 -0.303391  5   4
2013-01-06 -0.269234 -0.092784 -0.161369  5   5

In [59]:
df.apply(np.cumsum)

                   A         B         C   D   F
2013-01-01  0.000000  0.000000 -0.065109   5 NaN
2013-01-02  0.186953 -0.243894 -0.502388  10   1
2013-01-03 -0.871080 -1.013764  0.620425  15   3
2013-01-04 -1.056214 -0.424243 -0.105332  20   6
2013-01-05 -2.877726 -1.333026 -0.408722  25  10
2013-01-06 -3.146960 -1.425811 -0.570091  30  15

In [60]:
df.apply(lambda x: x.max() - x.min())

A    2.008466
B    1.498305
C    1.848570
D    0.000000
F    4.000000
dtype: float64

# Histogramming
See more at Histogramming and Discretization

In [61]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    6
1    0
2    6
3    5
4    6
5    6
6    5
7    4
8    1
9    2
dtype: int32

In [62]:
s.value_counts()

6    4
5    2
4    1
2    1
1    1
0    1
dtype: int64

# String Methods
Series is equipped with a set of string processing methods in the _str_ attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in str generally uses regular expressions by default (and in some cases always uses them). See more at Vectorized String Methods.

In [63]:
s = pd.Series(['A', 'B', 'C', 'Aaba', 'Baca', np.nan, 'CABA', 'dog', 'cat'])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

# Merge
# Concat
pandas provides various facilities for easily combining together Series, DataFrame, and Panel objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.
See the Merging section
Concatenating pandas objects together with concat()

In [64]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0  0.267331 -0.141202  0.431333 -0.712134
1 -0.712747  1.221494 -0.808476 -1.477871
2 -0.162593  0.896885  0.119301  1.405340
3  0.335074 -0.654046 -0.252527 -1.744649
4  0.584204 -1.487772 -0.268274  1.970303
5 -0.553904 -0.219016  1.201804 -0.946631
6 -1.710935 -1.490426  0.349288 -0.432007
7 -0.744195  0.791459  0.407510 -0.249683
8  0.993565 -0.083140 -0.263522 -0.356714
9 -0.082065 -1.948700 -0.500718 -0.313968

In [68]:
# break it into pieces
pieces = [df[:3], df[3:7], df[7:]]
pieces[0]

          0         1         2         3
0  0.267331 -0.141202  0.431333 -0.712134
1 -0.712747  1.221494 -0.808476 -1.477871
2 -0.162593  0.896885  0.119301  1.405340

In [70]:
pieces[1]

          0         1         2         3
3  0.335074 -0.654046 -0.252527 -1.744649
4  0.584204 -1.487772 -0.268274  1.970303
5 -0.553904 -0.219016  1.201804 -0.946631
6 -1.710935 -1.490426  0.349288 -0.432007

In [67]:
pd.concat(pieces)

          0         1         2         3
0  0.267331 -0.141202  0.431333 -0.712134
1 -0.712747  1.221494 -0.808476 -1.477871
2 -0.162593  0.896885  0.119301  1.405340
3  0.335074 -0.654046 -0.252527 -1.744649
4  0.584204 -1.487772 -0.268274  1.970303
5 -0.553904 -0.219016  1.201804 -0.946631
6 -1.710935 -1.490426  0.349288 -0.432007
7 -0.744195  0.791459  0.407510 -0.249683
8  0.993565 -0.083140 -0.263522 -0.356714
9 -0.082065 -1.948700 -0.500718 -0.313968

# Join
SQL style merges. See the Database style joining

In [72]:
left = pd.DataFrame({'key': ['foo', 'foo'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  foo     2

In [73]:
right

   key  rval
0  foo     4
1  foo     5

In [74]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

Another example that can be given is:

In [75]:
left = pd.DataFrame({'key': ['foo', 'bar'], 'lval': [1, 2]})
right = pd.DataFrame({'key': ['foo', 'bar'], 'rval': [4, 5]})
left

   key  lval
0  foo     1
1  bar     2

In [76]:
right

   key  rval
0  foo     4
1  bar     5

In [77]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

# Append
Append rows to a dataframe. See the Appending

In [78]:
df = pd.DataFrame(np.random.randn(8, 4), columns=['A','B','C','D'])
df

          A         B         C         D
0  0.109761  1.131165 -0.617850 -1.604738
1  0.771977 -0.270254  0.035751 -0.596119
2  1.665868  0.266361  0.553299  0.283030
3 -0.215506 -0.588245  2.942301 -0.109927
4  1.797645  0.290830 -0.548492  1.220973
5  1.284699  0.239065  0.132156 -0.671103
6 -0.730618 -1.061885 -0.325266 -1.084596
7  0.819927 -1.468219 -1.663592 -0.890621

In [79]:
s = df.iloc[3]
df.append(s, ignore_index=True)

          A         B         C         D
0  0.109761  1.131165 -0.617850 -1.604738
1  0.771977 -0.270254  0.035751 -0.596119
2  1.665868  0.266361  0.553299  0.283030
3 -0.215506 -0.588245  2.942301 -0.109927
4  1.797645  0.290830 -0.548492  1.220973
5  1.284699  0.239065  0.132156 -0.671103
6 -0.730618 -1.061885 -0.325266 -1.084596
7  0.819927 -1.468219 -1.663592 -0.890621
8 -0.215506 -0.588245  2.942301 -0.109927

# Grouping
By “group by” we are referring to a process involving one or more of the following steps
- Splitting the data into groups based on some criteria
- Applying a function to each group independently
- Combining the results into a data structure

See the Grouping section

In [80]:
df = pd.DataFrame({'A' : ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'],
    'B' : ['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'],
    'C' : np.random.randn(8),
    'D' : np.random.randn(8)})
df

     A      B         C         D
0  foo    one  0.335842 -0.976370
1  bar    one -1.362710  0.998563
2  foo    two  0.267437 -0.046951
3  bar  three  0.783978 -0.087028
4  foo    two -1.158654 -0.805333
5  bar    two  0.081006 -0.413152
6  foo    one -0.431322 -0.958323
7  foo  three -0.430516  0.843789

Grouping and then applying a function sum to the resulting groups.

In [84]:
df.groupby('A').sum()

            C         D
A
bar -0.497727  0.498383
foo -1.417213 -1.943188

In [85]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one   -1.362710  0.998563
    three  0.783978 -0.087028
    two    0.081006 -0.413152
foo one   -0.095480 -1.934693
    three -0.430516  0.843789
    two   -0.891218 -0.852284

# Reshaping
Stack

In [86]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 'foo', 'foo', 'qux', 'qux'],
    ['one', 'two', 'one', 'two', 'one', 'two', 'one', 'two']]))
 
index = pd.MultiIndex.from_tuples(tuples, names=['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=['A', 'B'])
df2 = df[:4]
df2

                     A         B
first second
bar   one     0.029814 -1.737219
      two    -0.162741  0.836550
baz   one    -0.020199 -1.692090
      two     1.444016  0.687548

In [87]:
index

MultiIndex(levels=[['bar', 'baz', 'foo', 'qux'], ['one', 'two']],
           labels=[[0, 0, 1, 1, 2, 2, 3, 3], [0, 1, 0, 1, 0, 1, 0, 1]],
           names=['first', 'second'])

In [88]:
df

                     A         B
first second
bar   one     0.029814 -1.737219
      two    -0.162741  0.836550
baz   one    -0.020199 -1.692090
      two     1.444016  0.687548
foo   one    -1.381589  1.649182
      two    -1.306833  0.666739
qux   one     0.771130 -0.008932
      two     1.504468 -0.597324

The stack() method “compresses” a level in the DataFrame’s columns.

In [90]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.029814
               B   -1.737219
       two     A   -0.162741
               B    0.836550
baz    one     A   -0.020199
               B   -1.692090
       two     A    1.444016
               B    0.687548
dtype: float64

With a “stacked” DataFrame or Series (having a MultiIndex as the index), the inverse operation of stack() is unstack(), which by default unstacks the last level:

In [91]:
stacked.unstack()

                     A         B
first second
bar   one     0.029814 -1.737219
      two    -0.162741  0.836550
baz   one    -0.020199 -1.692090
      two     1.444016  0.687548

In [93]:
stacked.unstack(1)

second        one       two
first
bar   A  0.029814 -0.162741
      B -1.737219  0.836550
baz   A -0.020199  1.444016
      B -1.692090  0.687548

In [94]:
stacked.unstack(0)

first          bar       baz
second
one    A  0.029814 -0.020199
       B -1.737219 -1.692090
two    A -0.162741  1.444016
       B  0.836550  0.687548

# Pivot Tables

In [95]:
df = pd.DataFrame({'A' : ['one', 'one', 'two', 'three'] * 3,
    'B' : ['A', 'B', 'C'] * 4,
    'C' : ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2,
    'D' : np.random.randn(12),
    'E' : np.random.randn(12)})

df

        A  B    C         D         E
0     one  A  foo -0.172335 -1.416154
1     one  B  foo  0.477848  0.859125
2     two  C  foo  0.924430  1.412648
3   three  A  bar  1.019967 -0.662021
4     one  B  bar  1.276703 -0.006621
5     one  C  bar  1.925994  0.635100
6     two  A  foo -0.874524 -0.097081
7   three  B  foo  0.289534 -1.823384
8     one  C  foo -0.864344  1.241546
9     one  A  bar  0.344007  1.518759
10    two  B  bar  0.682055 -1.539465
11  three  C  bar -0.739660  0.335125

We can produce pivot tables from this data very easily:

In [96]:
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A  0.344007 -0.172335
      B  1.276703  0.477848
      C  1.925994 -0.864344
three A  1.019967       NaN
      B       NaN  0.289534
      C -0.739660       NaN
two   A       NaN -0.874524
      B  0.682055       NaN
      C       NaN  0.924430